lukasnee/m8ec/platform/STM32H750/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TFT_CS_Pin GPIO_PIN_2
#define TFT_CS_GPIO_Port GPIOA
#define TFT_RESET_Pin GPIO_PIN_3
#define TFT_RESET_GPIO_Port GPIOA
#define TFT_DC_Pin GPIO_PIN_4
#define TFT_DC_GPIO_Port GPIOA
#define USB_OTG_VBUS_OUT_Pin GPIO_PIN_15
#define USB_OTG_VBUS_OUT_GPIO_Port GPIOD
#define keys_col0_Pin GPIO_PIN_0
#define keys_col0_GPIO_Port GPIOD
#define keys_col1_Pin GPIO_PIN_1
#define keys_col1_GPIO_Port GPIOD
#define keys_col2_Pin GPIO_PIN_2
#define keys_col2_GPIO_Port GPIOD
#define keys_col3_Pin GPIO_PIN_3
#define keys_col3_GPIO_Port GPIOD
#define keys_row0_Pin GPIO_PIN_4
#define keys_row0_GPIO_Port GPIOD
#define keys_row1_Pin GPIO_PIN_5
#define keys_row1_GPIO_Port GPIOD
#define keys_row2_Pin GPIO_PIN_6
#define keys_row2_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
